In [1]:
import pandas as pd
import numpy as np

In [2]:
#RAINFALL_MELB = r"C:\Users\ASUS\OneDrive\Semester 3\Innovation Project\Assign_02\rainfall_melb.csv"
RAINFALL_ADEL = r"C:\Users\ASUS\OneDrive\Semester 3\Innovation Project\Assign_02\Adelaide_rainfall\adelaide_rainfall.csv"

In [3]:
#rainfall_melb = pd.read_csv(RAINFALL_MELB)
rainfall_adel = pd.read_csv(RAINFALL_ADEL)

In [4]:
rainfall_adel

,Product code,Station Number,Year,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,Annual
0,IDCJAC0001,23034,1955,NaN,NaN,2.3,46.2,93.7,136.1,33.2,76.4,49.5,45.1,53.3,18.0,NaN
1,IDCJAC0001,23034,1956,23.9,6.6,43.2,72.9,88.5,115.6,65.8,44.5,55.2,40.2,15.8,17.6,589.8
2,IDCJAC0001,23034,1957,0.3,0.8,21.1,21.6,40.1,63.4,83.1,32.4,34.5,41.1,33.7,7.8,379.9
3,IDCJAC0001,23034,1958,3.9,2.3,22.1,13.5,89.3,8.2,79.2,51.2,70.4,61.3,10.3,6.6,418.3
4,IDCJAC0001,23034,1959,4.4,19.4,23.9,7.1,4.4,11.5,34.1,41.8,28.0,20.9,21.5,34.6,251.6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
65,IDCJAC0001,23034,2020,17.8,32.8,4.8,88.2,40.8,48.0,15.2,34.0,42.2,41.4,10.8,17.0,393.0
66,IDCJAC0001,23034,2021,26.0,18.8,17.6,11.2,30.6,79.6,85.4,39.4,22.0,40.6,29.8,1.6,402.6
67,IDCJAC0001,23034,2022,40.0,9.0,12.0,15.0,63.2,60.8,21.6,72.2,49.2,44.6,85.4,8.0,481.0
68,IDCJAC0001,23034,2023,17.8,12.8,31.2,45.8,62.2,107.0,37.4,37.6,20.6,12.0,59.0,56.2,499.6
69,IDCJAC0001,23034,2024,55.6,0.0,2.4,12.8,9.4,56.6,43.4,36.0,NaN,NaN,NaN,NaN,NaN

In [5]:
rainfall_adel.drop_duplicates()

,Product code,Station Number,Year,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,Annual
0,IDCJAC0001,23034,1955,NaN,NaN,2.3,46.2,93.7,136.1,33.2,76.4,49.5,45.1,53.3,18.0,NaN
1,IDCJAC0001,23034,1956,23.9,6.6,43.2,72.9,88.5,115.6,65.8,44.5,55.2,40.2,15.8,17.6,589.8
2,IDCJAC0001,23034,1957,0.3,0.8,21.1,21.6,40.1,63.4,83.1,32.4,34.5,41.1,33.7,7.8,379.9
3,IDCJAC0001,23034,1958,3.9,2.3,22.1,13.5,89.3,8.2,79.2,51.2,70.4,61.3,10.3,6.6,418.3
4,IDCJAC0001,23034,1959,4.4,19.4,23.9,7.1,4.4,11.5,34.1,41.8,28.0,20.9,21.5,34.6,251.6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
65,IDCJAC0001,23034,2020,17.8,32.8,4.8,88.2,40.8,48.0,15.2,34.0,42.2,41.4,10.8,17.0,393.0
66,IDCJAC0001,23034,2021,26.0,18.8,17.6,11.2,30.6,79.6,85.4,39.4,22.0,40.6,29.8,1.6,402.6
67,IDCJAC0001,23034,2022,40.0,9.0,12.0,15.0,63.2,60.8,21.6,72.2,49.2,44.6,85.4,8.0,481.0
68,IDCJAC0001,23034,2023,17.8,12.8,31.2,45.8,62.2,107.0,37.4,37.6,20.6,12.0,59.0,56.2,499.6
69,IDCJAC0001,23034,2024,55.6,0.0,2.4,12.8,9.4,56.6,43.4,36.0,NaN,NaN,NaN,NaN,NaN

In [6]:
rainfall_adel = rainfall_adel.drop(columns=['Product code'])
rainfall_adel = pd.melt(rainfall_adel, id_vars=['Station Number', 'Year'],
                         var_name='Month', value_name='Rainfall')

In [7]:
rainfall_adel

     Station Number  Year   Month  Rainfall
0             23034  1955     Jan       NaN
1             23034  1956     Jan      23.9
2             23034  1957     Jan       0.3
3             23034  1958     Jan       3.9
4             23034  1959     Jan       4.4
..              ...   ...     ...       ...
905           23034  2020  Annual     393.0
906           23034  2021  Annual     402.6
907           23034  2022  Annual     481.0
908           23034  2023  Annual     499.6
909           23034  2024  Annual       NaN

[910 rows x 4 columns]

In [8]:
rainfall_adel = rainfall_adel[rainfall_adel['Year'] >= 2017]

In [9]:
rainfall_adel = rainfall_adel.drop(rainfall_adel[rainfall_adel['Month'] == 'Annual'].index)

In [10]:
rainfall_adel['Month'] = pd.to_datetime(rainfall_adel['Month'], format='%b').dt.month

In [11]:
rainfall_adel

     Station Number  Year  Month  Rainfall
62            23034  2017      1      39.4
63            23034  2018      1       8.8
64            23034  2019      1       0.2
65            23034  2020      1      17.8
66            23034  2021      1      26.0
..              ...   ...    ...       ...
835           23034  2020     12      17.0
836           23034  2021     12       1.6
837           23034  2022     12       8.0
838           23034  2023     12      56.2
839           23034  2024     12       NaN

[96 rows x 4 columns]

In [12]:
rainfall_adel.rename(columns={'Station Number': 'Departing_Port'}, inplace=True)

In [13]:
rainfall_adel

     Departing_Port  Year  Month  Rainfall
62            23034  2017      1      39.4
63            23034  2018      1       8.8
64            23034  2019      1       0.2
65            23034  2020      1      17.8
66            23034  2021      1      26.0
..              ...   ...    ...       ...
835           23034  2020     12      17.0
836           23034  2021     12       1.6
837           23034  2022     12       8.0
838           23034  2023     12      56.2
839           23034  2024     12       NaN

[96 rows x 4 columns]

In [14]:
rainfall_adel['Departing_Port'].unique()

array([23034], dtype=int64)

In [15]:
rainfall_adel['Departing_Port'] = rainfall_adel['Departing_Port'].astype(str)
rainfall_adel['Departing_Port'].replace('23034', 'Adelaide', inplace=True)

In [16]:
rainfall_adel

    Departing_Port  Year  Month  Rainfall
62        Adelaide  2017      1      39.4
63        Adelaide  2018      1       8.8
64        Adelaide  2019      1       0.2
65        Adelaide  2020      1      17.8
66        Adelaide  2021      1      26.0
..             ...   ...    ...       ...
835       Adelaide  2020     12      17.0
836       Adelaide  2021     12       1.6
837       Adelaide  2022     12       8.0
838       Adelaide  2023     12      56.2
839       Adelaide  2024     12       NaN

[96 rows x 4 columns]

In [17]:
rainfall_adel

    Departing_Port  Year  Month  Rainfall
62        Adelaide  2017      1      39.4
63        Adelaide  2018      1       8.8
64        Adelaide  2019      1       0.2
65        Adelaide  2020      1      17.8
66        Adelaide  2021      1      26.0
..             ...   ...    ...       ...
835       Adelaide  2020     12      17.0
836       Adelaide  2021     12       1.6
837       Adelaide  2022     12       8.0
838       Adelaide  2023     12      56.2
839       Adelaide  2024     12       NaN

[96 rows x 4 columns]

In [18]:
rainfall_adel[rainfall_adel.isna().any(axis=1)]

    Departing_Port  Year  Month  Rainfall
629       Adelaide  2024      9       NaN
699       Adelaide  2024     10       NaN
769       Adelaide  2024     11       NaN
839       Adelaide  2024     12       NaN

In [19]:
rainfall_adel['Rainfall'] = rainfall_adel['Rainfall'].interpolate(method='linear')

In [20]:
rainfall_adel[rainfall_adel.isna().any(axis=1)]

Empty DataFrame
Columns: [Departing_Port, Year, Month, Rainfall]
Index: []

In [22]:
rainfall_adel.to_csv("rainfall_adel_processed.csv", header=True, index=False)